#include <iostream> //Подключение библитоеки iostream
#include <cmath> //Подключение библитоеки cmath
#include <format> //Подключение библитоеки format
#include <string> //Подключение библитоеки string


int main()// Основная функция 
{
	//Точка входа в программу
	setlocale(LC_ALL, "ru"); //Установка русской локали для функций 
	double m, n;// Объявление переменных m и n
	std::cout << "Введите коэффициент m\n";
	// Просьба пользователя ввести переменную m
	std::cin >> m;
	//Ввод переменной m
	std::cout << "Введите коэффициент n\n";
	// Просьба пользователя ввести переменную n
	std::cin >> n;
	//Ввод переменной n
	double F = -std::pow(n, 2) * (12 * m + 5); 
	// Объявление переменной с результатом подсчёта выражения
	std::cout << std::format("Значение выражения -n^2 * (12m + 5) "
		"при n = {}, m = {}: {}", m, n, F);
	//Вывод результата
	return 0;//Завершение выполнения программы

}
