#include <iostream>//Подключение библиотеки iostream
#include <cmath> //Подключение библиотеки cmath

int main()// Основная функция 
{
	//Точка входа в программу
	setlocale(LC_ALL, "ru"); //Установка русской локали для функций 
	double a, b, c; // Объявление переменных a, b и c
	std::cout << "Введите коэффициент a\n";
	// Просьба пользователю ввести переменную a
	std::cin >> a;
	//Ввод переменной a
	std::cout << "Введите коэффициент b\n";
	// Просьба пользователю ввести переменную b
	std::cin >> b;
	//Ввод переменной b
	std::cout << "Введите коэффициент c\n";
	// Просьба пользователю ввести переменную c
	std::cin >> c;
	//Ввод переменной c
Enter_S://Установка "точки возврата" для случая, если введён неизвестный символ
	std::cout << "Введите символ\n";// Просьба пользователю ввести символ
	char S;//Объявление переменной S
	std::cin >> S;//Ввод переменной S
	switch (S) {// Создание "обработчика" значения S
	case 'K': {//Блок кода, который сработает при S == 'K'
		std::cout << "Kuznetsov Artem\n";//Вывод имени и фамилии
		break;//Выход из switch
	}
	case 'j': {//Блок кода, который сработает при S == 'j'
		if (a == b && b == c && a == c && a == 0) {//Сравнение переменных с 0
			std::cout << "x - любое число\n";//Вывод "x - любое число"
			break;//Выход из switch
		}
		double D = std::pow(b, 2) - 4 * a * c;//Подсчёт дискриминанта 
		if (D < 0) {//Сравнение D < 0
			std::cout << "У этого квадратного уравнения нет корней\n";
			//Вывод "У этого квадратного уравнения нет корней"
			break;//Выход из switch
		}
		else if (D == 0) {//Сравнение D == 0
			std::cout << "x1 = " << -b / (2 * a);
			//Подсчёт и вывод единственного корня
		}
		else {//D > 0
			std::cout << "x1 = " << (-b + std::pow(D, 0.5)) / (2 * a)
				<< "\n";
			std::cout << "x2 = " << (-b - std::pow(D, 0.5)) / (2 * a);
			//Подсчёт и вывод двух корней
		}
		break;//Выход из switch
	}
	case 's': { //Блок кода, который сработает при S == 's'
		double One, Two, Three;
		//Объявление переменных One, Two, Three
		std::cout << "Введите первую сторону треугольника\n";
		// Просьба пользователю ввести переменную One
		std::cin >> One;
		//Ввод переменной One
		std::cout << "Введите вторую сторону треугольника\n";
		// Просьба пользователю ввести переменную Two
		std::cin >> Two;
		//Ввод переменной Two
		std::cout << "Введите третью сторону треугольника\n";
		// Просьба пользователю ввести переменную Three
		std::cin >> Three;
		//Ввод переменной Three
		if (One == Two && Two == Three && Three == One) {
			//Проверка равенства переменных One, Two и Three
			std::cout << "Данный треугольник равнобедренный\n";
			//Вывод "Данный треугольник равнобедренный"
		}
		else {
		// One != Two != Three
			std::cout << "Данный треугольник не равнобедренный\n";
			//Вывод "Данный треугольник не равнобедренный"
		}
		break;//Выход из switch
	}
	default: {//Блок кода, который сработает при S, не равном ни одному из значений выше
		std::cout << "Символ не найден!\n";
		//Вывод "Символ не найден!"
		goto Enter_S;//Возврат к вводу символа
		break;//Выход из switch
	}
	}
}
