#include <iostream> //Подключение библиотеки iostream
#include <cmath> //Подключение библиотеки cmath
#include <format> //Подключение библиотеки format
#include <string> //Подключение библиотеки string


int main()// Основная функция 
{
	//Точка входа в программу
	setlocale(LC_ALL, "ru"); //Установка русской локали для функций 
	double m, n;// Объявление переменных m и n
	std::cout << "Введите коэффициент m\n";
	// Просьба пользователю ввести переменную m
	std::cin >> m;
	//Ввод переменной m
	std::cout << "Введите коэффициент n\n";
	// Просьба пользователю ввести переменную n
	std::cin >> n;
	//Ввод переменной n
	double F = -std::pow(n, 2) * (12 * m + 5); 
	// Объявление переменной с результатом подсчёта выражения
	std::cout << std::format("Значение выражения -n^2 * (12m + 5) "
		"при n = {}, m = {}: {}", n, m, F);
	//Вывод результата
	return 0;//Завершение выполнения программы

}
